
## Plan Result (aat)




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
        id                      = "https://am-aat.vault.azure.net/secrets/judicial-booking-service-POSTGRES-PASS/96d5cf3f24704e698e7c9c6c8f7a2808"
        name                    = "judicial-booking-service-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://am-aat.vault.azure.net/secrets/judicial-booking-service-POSTGRES-USER/49e2020d77cf4de6b2fa137fdc31ca74"
        name                    = "judicial-booking-service-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat"
      + name                    = "judicial-booking-service-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat"
      + name                    = "judicial-booking-service-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/am-shared-infrastructure-aat/providers/Microsoft.KeyVault/vaults/am-aat"
      + name                    = "judicial-booking-service-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1066,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->